{
    "navHOME": "Home",
    "navSKILLS": "Skills",
    "navPROJECTS": "Projects",
    "navCONTACT ME": "Contact",
    "mainTitle1": "Hi, I'm Mateusz",
    "mainTitle2": "Web Developer",
    "mainDescription": "I'm a programmer with academic experience and a strong passion for music, seeking experience and mentorship within a programming team. I thrive in collaborative environments and value teamwork. I’m focused on creating web-based projects, always open to new challenges, especially those that involve solutions I am unfamiliar with. I solve problems by breaking them down into their essentials.",
    "mainDescription2": "I would like to work on backend solutions and improve my skills in the following areas. I'm particularly interested and comfortable with .NET solutions for web-based services. Most of my projects revolved around REST APIs created with ASP.NET.",
    "mainCV": "Resume",
    "mainSkills": "Skills",
    "mainProjects": "Projects",
    "mainContact": "Contact",
    "contactName": "Name",
    "contactEmail": "Email address",
    "contactMessage": "Message",
    "contactSend": "Send",
    "toastSending": "Sending...",
    "toastSent": "Message sent!",
    "toastError": "Failed to send message!",
    "toastCopy": "Copied to clipboard!",
    "toastLoading": "Sending...",
    "project1Name": "Spotify Top Stats",
    "project1Description": "An app that uses Spotify’s API to display a user’s top artists and songs, or artists’ top songs and recommendations. This project consists of only one layer: the frontend. All logic is implemented using React hooks and pure JS functions",
    "project1Description2": "The creation of this project has helped me to deepen my knowledge of React hooks and workflow with the Spotify API.",
    "project1Role": "frontend",
    "project2Name": "Watchlist",
    "project2Description": "Planned/Watched list application for movies and anime. The user can add movies and anime to their watchlist and change their status for watched/planned. The application uses the external APIs to get the data.",
    "project2Description2":"During the development of this project, my goal was to properly containerise an application and work with external APIs.",
    "project2Role": "backend, containerization",
    "project3Name": "TSTYGRYLL",
    "project3Description": "MVC application for restaurant table reservation. The user can select a date and time and book a table. All the data is customizable via the admin panel.",
    "project3Description2": "While building this application, I focused on the MVC pattern and the flow of data between layers, and the use of a relational database in such a pattern.",
    "project3Role": "MVC",
    "project4Name": "Trackify",
    "project4Description": "Social media application inspired by Last.FM and Rate Your Music. Listening history tracking via Spotify API. Explore the most popular and favorite items of a selected profile or all app users, and create collages and summaries based on this data. Rate and comment on selected items and use social networking features such as watching other users or commenting on their profiles.",
    "project4Description2": "I designed and implemented a system to track listening history by scheduling code execution and using the Spotify API. I was also responsible for containerising the application, which consisted of customizing the application layers and creating the necessary configuration files.",
    "project4Role": "backend, containerization, project managmement",
    "projectSoon": "Coming soon..."
}