{
    "navHOME": "Home",
    "navSKILLS": "Skills",
    "navPROJECTS": "Projects",
    "navCONTACT ME": "Contact",
    "mainTitle1": "Hi, I'm Mateusz",
    "mainTitle2": "Web Developer",
    "mainDescription": "I am currently a first semester master's student at Lublin University of Technology. I specialize in web programming, both frontend and backend . In my free time I learn new technologies, create projects and develop my skills. I am looking for opportunities to gain experience in the IT industry to grow professionally and gain new skills.",
    "mainCV": "Resume",
    "mainSkills": "Skills",
    "mainProjects": "Projects",
    "mainContact": "Contact",
    "contactName": "Name",
    "contactEmail": "Email address",
    "contactMessage": "Message",
    "contactSend": "Send",
    "toastSent": "Message sent!",
    "toastError": "Failed to send message!",
    "toastCopy": "Copied to clipboard!",
    "toastLoading": "Sending...",
    "project1Name": "Spotify Top Stats",
    "project1Description": "Frontend only application that uses the Spotify API to display a user's or artist's top artists and tracks. The user can select a time range and create a playlist of their top tracks.",
    "project2Name": "Watchlist",
    "project2Description": "Planned/Watched list application for movies and anime. The user can add movies and anime to their watchlist and change their status for watched/planned. The application uses the external APIs to get the data",
    "project3Name": "Restaurant table reservation",
    "project3Description": "Fullstack application for restaurant table reservation. The user can select a date and time and book a table. All the data is customizable via the admin panel.",
    "project4Name": "Trackify",
    "project4Description": "Project for my Engineering Thesis. Social media application inspired by Last.FM and Rate Your Music. The user can connect their Spotify account and track their listening history. Users of the app will be able to view the most popular and favourite acts of a selected profile, or of all app users, and create collages and summaries based on this data. The application will allow ratings and comments for selected entities, and will offer typical social networking functionalities such as observing other users or publishing comments on their profiles.",
    "projectSoon": "Coming soon..."
}