{
    "navHOME": "Strona główna",
    "navSKILLS": "Umiejętności",
    "navPROJECTS": "Projekty",
    "navCONTACT ME": "Kontakt",
    "mainTitle1": "Cześć, jestem Mateusz",
    "mainTitle2": "Web Developer",
    "mainDescription": "Jestem programistą z doświadczeniem akademickim i silną pasją do muzyki, poszukującym doświadczenia i mentoringu w zespole programistycznym. Dobrze się czuję w środowisku opartym na współpracy i cenię pracę zespołową. Koncentruję się na tworzeniu projektów internetowych, zawsze otwarty na nowe wyzwania, zwłaszcza te, które obejmują rozwiązania, których nie znam. Rozwiązuję problemy, rozkładając je na czynniki pierwsze.",
    "mainDescription2": "Chciałbym pracować nad rozwiązaniami backendowymi i doskonalić swoje umiejętności w następujących obszarach. Jestem szczególnie zainteresowany i czuję się komfortowo z rozwiązaniami .NET dla usług internetowych. Większość moich projektów dotyczyła REST API tworzonych w ASP.NET.",
    "mainCV": "CV",
    "mainSkills": "Umiejętności",
    "mainProjects": "Projekty",
    "mainContact": "Kontakt",
    "contactName": "Imię i nazwisko", 
    "contactEmail": "Adres email",
    "contactMessage": "Wiadomość",
    "toastSending": "Wysyłanie wiadomości...",
    "contactSend": "Wyślij",
    "toastSent": "Wiadomość wysłana!",
    "toastError": "Przy wysyłaniu wiadomości wystąpił błąd!",
    "toastCopy": "Skopiowano do schowka!",
    "toastLoading": "Wysyłanie wiadomości...",
    "project1Name": "Spotify Top Stats",
    "project1Description": "Aplikacja wykorzystująca API Spotify do wyświetlania najlepszych wykonawców i utworów użytkownika lub najlepszych utworów i rekomendacji wykonawców. Ten projekt składa się tylko z jednej warstwy: frontendu. Cała logika jest zaimplementowana przy użyciu hooków React i czystych funkcji JS",
    "project1Description2": "Stworzenie tego projektu pomogło mi pogłębić moją wiedzę na temat hooków React i przepływu pracy z API Spotify.",
    "project1Role": "frontend",
    "project2Name": "Watchlist",
    "project2Description": "Aplikacja z listą zaplanowanych/obejrzanych filmów i anime. Użytkownik może dodawać filmy i anime do swojej listy obserwowanych i zmieniać ich status na oglądane/planowane. Aplikacja wykorzystuje zewnętrzne API do pobierania danych",
    "project2Description2": "Podczas tworzenia tego projektu moim celem było prawidłowe zkonteneryzowanie aplikacji i praca z zewnętrznymi interfejsami API.",
    "project2Role": "backend, konteneryzacja",
    "project3Name": "Rezerwacja stolika w restauracji",
    "project3Description": "Aplikacja MVC do rezerwacji stolika w restauracji. Użytkownik może wybrać datę i godzinę oraz zarezerwować stolik. Wszystkie dane można dostosować za pomocą panelu administracyjnego.",
    "project3Description2": "Podczas tworzenia tej aplikacji skupiłem się na wzorcu MVC i przepływie danych między warstwami oraz wykorzystaniu relacyjnej bazy danych w takim wzorcu.",
    "project3Role": "MVC",
    "project4Name": "Trackify",
    "project4Description": "Aplikacja społecznościowa inspirowana Last.FM i Rate Your Music. Śledzenie historii słuchania za pośrednictwem Spotify API. Przeglądanie najpopularniejszych i ulubionych pozycji wybranego profilu lub wszystkich użytkowników aplikacji oraz tworzenie kolaży i podsumowań na podstawie tych danych. Ocenianie i komentowanie wybranych utworów oraz korzystanie z funkcji społecznościowych, takich jak obserwowanie innych użytkowników lub komentowanie ich profili.",
    "project4Description2": "Zaprojektowałem i wdrożyłem system śledzenia historii odsłuchu poprzez planowanie wykonywania kodu i wykorzystanie API Spotify. Byłem również odpowiedzialny za konteneryzację aplikacji, która polegała na dostosowaniu warstw aplikacji i stworzeniu niezbędnych plików konfiguracyjnych.",
    "project4Role": "backend, konteneryzacja, zarządzanie projektem",
    "projectSoon": "Wkrótce..."
}