{
    "navHOME": "Strona główna",
    "navSKILLS": "Umiejętności",
    "navPROJECTS": "Projekty",
    "navCONTACT ME": "Kontakt",
    "mainTitle1": "Cześć, jestem Mateusz",
    "mainTitle2": "Web Developer",
    "mainDescription": "Obecnie jestem studentem pierwszego semestru studiów magisterskich na Politechnice Lubelskiej. Specjalizuje się w programowaniu webowym, zarówno od strony frontendowej jak i backendowej . W wolnym czasie uczę się nowych technologii, tworzę projekty i rozwijam swoje umiejętności. Szukam możliwości zdobycia doświadczenia w branży IT, aby rozwijać się zawodowo i zdobywać nowe umiejętności.",
    "mainCV": "CV",
    "mainSkills": "Umiejętności",
    "mainProjects": "Projekty",
    "mainContact": "Kontakt",
    "contactName": "Imię i nazwisko", 
    "contactEmail": "Adres email",
    "contactMessage": "Wiadomość",
    "contactSend": "Wyślij",
    "toastSent": "Wiadomość wysłana!",
    "toastError": "Przy wysyłaniu wiadomości wystąpił błąd!",
    "toastCopy": "Skopiowano do schowka!",
    "toastLoading": "Wysyłanie wiadomości...",
    "project1Name": "Spotify Top Stats",
    "project1Description": "Aplikacja wykorzystująca interfejs API Spotify do wyświetlania najlepszych wykonawców i utworów użytkownika lub artysty. Użytkownik może wybrać zakres czasowy i utworzyć playliste na podstawie swoich najlepszych utworów.",
    "project2Name": "Lista obejrzanych filmów i anime",
    "project2Description": "Aplikacja z listą zaplanowanych/obejrzanych filmów i anime. Użytkownik może dodawać filmy i anime do swojej listy obserwowanych i zmieniać ich status na oglądane/planowane. Aplikacja wykorzystuje zewnętrzne API do pobierania danych",
    "project3Name": "Rezerwacja stolika w restauracji",
    "project3Description": "Aplikacja do rezerwacji stolika w restauracji. Użytkownik może wybrać datę i godzinę oraz zarezerwować stolik. Wszystkie wyświetlane dane można dostosować za pomocą panelu administracyjnego.",
    "project4Name": "Trackify",
    "project4Description": "Projekt w ramach mojej pracy inżynierskiej. Aplikacja społecznościowa inspirowana Last.FM i Rate Your Music. Użytkownik może podłączyć swoje konto Spotify i śledzić historię słuchania. Użytkownicy aplikacji będą mogli przeglądać najpopularniejsze i ulubione utwory wybranego profilu lub wszystkich użytkowników aplikacji oraz tworzyć kolaże i podsumowania na podstawie tych danych. Aplikacja umożliwi ocenianie i komentowanie wybranych utworów, a także zaoferuje typowe funkcje społecznościowe, takie jak obserwowanie innych użytkowników czy publikowanie komentarzy na ich profilach.",
    "projectSoon": "Wkrótce..."
}